-------------------------------- 지우지 마시오----------------------------------------------------------------------------------------------------
-- 문제 09. (SQL 작성형) 가격이 50 이상인 상품 조회하기 (10점)
-- Product 테이블에는 상품의 이름(Name)과 가격(Price) 정보가 저장되어 있습니다.
-- [요구사항]
-- Price가 50 이상인 상품의 Name과 Price를 조회하는 SQL문을 작성하시오.
-- 결과는 Price 내림차순으로 정렬하시오.
-- 최종 제출용 쿼리만 남기고, 다른 쿼리는 모두 삭제한 뒤 제출하시오. (주석 불가)
-------------------------------- 지우지 마시오----------------------------------------------------------------------------------------------------








-------------------------------- 지우지 마시오----------------------------------------------------------------------------------------------------
-- 문제 10. (SQL 작성형) 완료된 주문의 고객 정보 조회하기 (10점)
-- Purchase 테이블에는 각 주문의 상태(Status)가 저장되어 있으며,
-- User 테이블에는 고객 정보가 저장되어 있습니다.
-- [요구사항]
--  Status가 'completed'인 주문을 한 고객의 Username과 Email을 조회하는 SQL문을 작성하시오.
--  중복된 고객이 없도록 조회하시오.
--  결과는 Username 오름차순으로 정렬하시오.
-- 최종 제출용 쿼리만 남기고, 다른 쿼리는 모두 삭제한 뒤 제출하시오. (주석 불가)
-------------------------------- 지우지 마시오----------------------------------------------------------------------------------------------------








-------------------------------- 지우지 마시오----------------------------------------------------------------------------------------------------
-- 문제 11. (SQL 작성형) 재고가 있는 상품의 카테고리별 최고가 조회하기 (5점)
-- Product 테이블에는 상품의 카테고리(CategoryId), 가격(Price), 재고 수량(StockQuantity)이 저장되어 있습니다.
-- 재고가 남아 있는 상품들 중에서 카테고리별로 가장 비싼 상품의 가격을 파악하려고 합니다.
-- [요구사항]
--  StockQuantity가 0보다 큰 상품을 대상으로, 카테고리별 최고 가격을 조회하는 SQL문을 작성하시오.
--  결과 컬럼명은 CategoryId, max_price 로 표시하시오.
--  결과는 max_price 내림차순으로 정렬하시오.
-- 최종 제출용 쿼리만 남기고, 다른 쿼리는 모두 삭제한 뒤 제출하시오. (주석 불가)
-------------------------------- 지우지 마시오----------------------------------------------------------------------------------------------------






